Revit 2024 API
ParameterTypeId.StairsPathStartExtension Property
 "Start Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsPathStartExtension { get; }
Visual Basic
Public Shared ReadOnly Property StairsPathStartExtension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsPathStartExtension {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace